<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f3b8b28f309be123b8515cb14ffbce05164a4c9e84db1bb51107821a06bedeaf","plan_job_ref":"Job Terraform plan #36 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132980198","plan_out_hash":"248fc3fdbaca943daaeb1e8858ce60d45e9be898a76127a7dc207dab0b3a829b","plan_hash":"56649a19f905a14f4a3b4ea709e14e1ac2dda9e2016d14eeb87de0a4a913509e","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
```
</details>
<details>
<summary>Plan: 4 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                = "d4ef136o48bqjg3sv4q7"
        name              = "receive-video-handler"
        tags              = []
!~      user_hash         = "41b35936f6a43159178c0012d6e6805eac2ac665479f306dd4dc9681ed0fe7bb" -> "a8d6da0463231b0c12d9f27dd0999bfcf20420ec9e3178981b537ea29f3cfa75"
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_function_trigger.receive-video-handler-trigger will be created
+   resource "yandex_function_trigger" "receive-video-handler-trigger" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "receive-video-handler-trigger"

+       function {
+           id = "d4ef136o48bqjg3sv4q7"
        }

+       message_queue {
+           batch_cutoff       = "0"
+           batch_size         = "1"
+           queue_id           = "****************************************************************************************************************"
+           service_account_id = (known after apply)
        }
    }

  # yandex_iam_service_account.receive-video-handler-trigger-sa will be created
+   resource "yandex_iam_service_account" "receive-video-handler-trigger-sa" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "receive-video-handler-sa"
    }

  # yandex_resourcemanager_folder_iam_member.receive-video-handler-function-trigger-invoker will be created
+   resource "yandex_resourcemanager_folder_iam_member" "receive-video-handler-function-trigger-invoker" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "functions.functionInvoker"
    }

  # yandex_resourcemanager_folder_iam_member.receive-video-handler-trigger-editor will be created
+   resource "yandex_resourcemanager_folder_iam_member" "receive-video-handler-trigger-editor" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = (known after apply)
+       role      = "editor"
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #21](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132994488)